#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_dev.module.onestopauth.module.client_test-123-test-100.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=f260fa79-f324-4d31-8c34-61bdb9385023]
module.keycloak_dev.module.onestopauth.module.client_confidential-2278.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=ed49f5c2-0ef8-4139-988c-487aff1ace0f]
module.keycloak_dev.module.onestopauth.module.client_test-123-test-100.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=37d59f60-7b95-4afc-b3fc-437d7656cdd9]
module.keycloak_dev.module.onestopauth.module.client_confidential-2278.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=fa37be77-a688-4e85-aee1-8fc1892b12cd]
module.keycloak_dev.module.onestopauth.module.client_confidential-2278.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8ab594d1-a6ed-41f0-8466-5b234ffcfb49]
module.keycloak_dev.module.onestopauth.module.client_test-123-test-100.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=b038e78a-e8f3-4fdd-924d-03472819501b]
module.keycloak_dev.module.onestopauth.module.client_confidential-2278.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=ef161232-e0cc-4960-ae44-26cc662473c6]
module.keycloak_dev.module.onestopauth.module.client_confidential-2278.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=4b0632ef-ced9-41ed-888a-473fab429cf5]
module.keycloak_dev.module.onestopauth.module.client_confidential-2278.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=8194373f-83a9-4466-95e7-0079b180a298]
module.keycloak_dev.module.onestopauth.module.client_confidential-2278.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c8ce7f6f-d5a0-4024-bff8-a9161f96eeb5]
module.keycloak_dev.module.onestopauth.module.client_jon-test-1-235.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=5a899829-73cb-4d83-aa47-9ff5cfc09811]
module.keycloak_dev.module.onestopauth.module.client_jon-test-1-235.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=0761203a-2944-4aa8-ab11-1d0ae1d7f471]
module.keycloak_dev.module.onestopauth.module.client_jon-test-1-235.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=a3db851f-e00f-4187-b2cb-43e52a785f34]
module.keycloak_dev.module.onestopauth.module.client_jon-test-1-235.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=83e71261-0e19-4a3d-8197-9af135129ca5]
module.keycloak_dev.module.onestopauth.module.client_jon-test-1-235.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=7f2b8414-48a5-4045-b477-40852eaf501e]
module.keycloak_dev.module.onestopauth.module.client_jon-test-1-235.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=f9b5dd63-6b70-4ce1-9503-2848391bd5c1]
module.keycloak_dev.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=31a1cdaa-a51f-43dc-85cf-4c846931ce29]
module.keycloak_dev.module.onestopauth.module.client_jon-test-1-235.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=ae2216ac-dec0-4883-8c8b-524b04ada3ce]
module.keycloak_dev.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=b8feccbc-035d-4aa1-9699-50ecd51667bf]
module.keycloak_dev.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=b8206f35-b055-4fba-ad25-1b128bf2f2dd]
module.keycloak_dev.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=39470b38-aaa9-48e5-a6e6-4f66302fcad1]
module.keycloak_dev.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=9b1151fa-e4d2-4619-919f-e1e2723d077f]
module.keycloak_dev.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=7039c887-d63a-4a76-be19-3f1a676bfc4e]
module.keycloak_dev.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=17a09474-dbcb-4bf6-9b37-82d8afd0d7d3]
module.keycloak_dev.module.onestopauth.module.client_mytestclientaaaa-135.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=fa0b6916-1bab-4a15-915b-c4374fb4ce91]
module.keycloak_dev.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=b4043d02-4132-4deb-b0ff-719e959bb797]
module.keycloak_dev.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=8b36b590-1b54-48b5-9902-883ea3376b01]
module.keycloak_dev.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=75087273-e5b5-4ade-b157-70c6ebe829b8]
module.keycloak_dev.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=38d3dd6c-7180-480a-8c32-8c48e7dcfadf]
module.keycloak_dev.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=c0369e84-01ea-42c2-9c88-c8b1c93a8123]
module.keycloak_dev.module.onestopauth.module.client_test-9-3-21-1486.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=1772ede9-79d6-484d-a32b-8f27a3ff202e]
module.keycloak_dev.module.onestopauth.module.client_test-3-08-10-2021-465.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=d0bc0f9e-8327-47ec-bca6-1f1e1baa303d]
module.keycloak_dev.module.onestopauth.module.client_test-3-08-10-2021-465.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=d424c47d-d0db-494c-b296-37612b26a62c]
module.keycloak_dev.module.onestopauth.module.client_test-3-08-10-2021-465.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=45a58d16-3fa3-453b-9a56-7f023d2e73df]
module.keycloak_dev.module.onestopauth.module.client_test-3-08-10-2021-465.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=f988d4ed-cba6-497a-9592-14f8181762f6]
module.keycloak_dev.module.onestopauth.module.client_test-3-08-10-2021-465.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=463abe9a-49c6-4e3f-8912-60ed0cdb6586]
module.keycloak_dev.module.onestopauth.module.client_test-3-08-10-2021-465.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=548d4bc8-baf3-4b7b-a1c2-cd17816963ba]
module.keycloak_dev.module.onestopauth.module.client_test-3-08-10-2021-465.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=860529bf-45f8-4fcb-a675-3ec25bb300f1]
module.keycloak_dev.module.onestopauth.module.client_project-test-7-27-2021-67.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=9fa72992-16bb-425d-a6ce-73d88f71931a]
module.keycloak_dev.module.onestopauth.module.client_project-test-7-27-2021-67.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=723cc968-2a88-4e28-b0ac-c277498734c7]
module.keycloak_dev.module.onestopauth.module.client_project-test-7-27-2021-67.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=54045bf5-9c16-41df-87aa-6cf149ecf5ea]
module.keycloak_dev.module.onestopauth.module.client_project-test-7-27-2021-67.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=391af413-2e3b-4c5a-b29a-1e2bfdf536cf]
module.keycloak_dev.module.onestopauth.module.client_project-test-7-27-2021-67.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=2eec2798-ebef-43da-9215-caf48e5b2f65]
module.keycloak_dev.module.onestopauth.module.client_project-test-7-27-2021-67.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=27c1b1b9-40a9-48fc-8769-dc904bc3a145]
module.keycloak_dev.module.onestopauth.module.client_project-test-7-27-2021-67.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=60cf3621-874e-4ef2-9637-5c48ce107e20]
module.keycloak_dev.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=83ab957d-9026-4268-8783-be60c70a7757]
module.keycloak_dev.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=7519df91-94ee-4fb5-887f-eca9cb19fa95]
module.keycloak_dev.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=5d4b88c0-8ce2-41ad-92f5-903bc4bcf045]
module.keycloak_dev.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=d88c19f8-86da-4ae5-bb41-9257b272479a]
module.keycloak_dev.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=5ff9a99e-210c-4667-9612-a087313f6869]
module.keycloak_dev.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=00ca6796-98fc-4d4a-b9fb-fcf28ed78ec3]
module.keycloak_dev.module.onestopauth.module.client_jon-test-5-336.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=0a74c851-8d61-4c6f-a9cb-c391aae49297]
module.keycloak_dev.module.onestopauth.module.client_test-email-notification-598.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=b9aab272-78e1-4cce-bae9-671b7e9dd760]
module.keycloak_dev.module.onestopauth.module.client_jon-test-5-336.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=1294a75a-f919-443a-b6c4-21aec8df64f3]
module.keycloak_dev.module.onestopauth.module.client_jon-test-5-336.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=6faae13d-1853-4137-a10c-4c8cd7e98719]
module.keycloak_dev.module.onestopauth.module.client_jon-test-5-336.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=58c3abf5-274a-4d78-ba65-805228c03c6e]
module.keycloak_dev.module.onestopauth.module.client_jon-test-5-336.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=462c309a-1e1e-49f9-ad15-0dca06081da5]
module.keycloak_dev.module.onestopauth.module.client_usability-testing-09-22-2014.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=b913bd05-a2d7-49b1-b69b-93c1ddba3349]
module.keycloak_dev.module.onestopauth.module.client_jon-test-5-336.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=0cd6a6d4-be26-4643-b2dc-a05bb0841e98]
module.keycloak_dev.module.onestopauth.module.client_jon-test-5-336.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=cf046218-5d2d-4ed0-9eb5-3e429509882a]
module.keycloak_dev.module.onestopauth.module.client_usability-testing-09-22-2014.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=e81cb88c-ee2b-459f-be81-5be1f8718c7a]
module.keycloak_dev.module.onestopauth.module.client_a-793.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=40bdbc21-55b7-4fe8-a0c9-4825bb3a38aa]
module.keycloak_dev.module.onestopauth.module.client_usability-testing-09-22-2014.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=266a1168-c75e-4f5a-8e51-4965c0d0af57]
module.keycloak_dev.module.onestopauth.module.client_usability-testing-09-22-2014.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=185a60b8-de1c-465f-8583-16f0349d662b]
module.keycloak_dev.module.onestopauth.module.client_a-793.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=b43023b0-0705-4a97-9bc5-ce8e592fa027]
module.keycloak_dev.module.onestopauth.module.client_a-793.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=3daeeedd-fbd5-4286-bff7-1f86597af5ea]
module.keycloak_dev.module.onestopauth.module.client_usability-testing-09-22-2014.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=c4d3c228-fabd-46e8-91c9-ec23937c79d4]
module.keycloak_dev.module.onestopauth.module.client_usability-testing-09-22-2014.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=63565251-3b31-4dd6-abb3-acd99adc2913]
module.keycloak_dev.module.onestopauth.module.client_usability-testing-09-22-2014.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=6f80453c-9122-4a29-89ab-a0c51d74b3ad]
module.keycloak_dev.module.onestopauth.module.client_a-793.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=66d2760b-86f2-45d9-b9a3-2d39cdb17361]
module.keycloak_dev.module.onestopauth.module.client_a-793.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=1e3cd89b-ee90-4e9e-9cc1-489a77a3f6c7]
module.keycloak_dev.module.onestopauth.module.client_a-793.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=c5df6293-4673-4f2a-aba0-93b97883d756]
module.keycloak_dev.module.onestopauth.module.client_a-793.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=632cfa78-6e73-4a7e-8841-be00340a2a03]
module.keycloak_dev.module.onestopauth.module.client_test-07-29-2021-233.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=09bf6d82-3a63-431c-8425-faf78176c2f3]
module.keycloak_dev.module.onestopauth.module.client_test-07-29-2021-233.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=a7cffed4-f8d5-470b-9c6b-9c9c4e14ac55]
module.keycloak_dev.module.onestopauth.module.client_test-07-29-2021-233.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=7288becc-cd99-4d6b-a994-e1b347bca160]
module.keycloak_dev.module.onestopauth.module.client_test-07-29-2021-233.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=c2ac05dc-7383-4ddf-8d74-1d06576d5e94]
module.keycloak_dev.module.onestopauth.module.client_test-07-29-2021-233.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=f6b8061d-6338-43a5-a5b8-3719b5f0bc8e]
module.keycloak_dev.module.onestopauth.module.client_test-07-29-2021-233.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=68a2f533-ebae-4369-8773-e1a5d2a32306]
module.keycloak_dev.module.onestopauth.module.client_test-07-29-2021-233.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=5f709164-1575-43d0-811b-d6aa4909d4d2]
module.keycloak_dev.module.onestopauth.module.client_jon-test-10-463.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=fff46c9b-2bd5-463c-af1d-56fe59f5b45d]
module.keycloak_dev.module.onestopauth.module.client_jon-test-10-463.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=c531f61f-df6e-4dcb-ae39-fbf50c075657]
module.keycloak_dev.module.onestopauth.module.client_jon-test-10-463.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=49566f8a-15bc-4f93-9e8e-3c0a7979b468]
module.keycloak_dev.module.onestopauth.module.client_jon-test-10-463.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=ac884f68-0833-473c-a1aa-b72168ee8cf8]
module.keycloak_dev.module.onestopauth.module.client_jon-test-10-463.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=12159969-e391-41ae-a758-40c2aa024cc7]
module.keycloak_dev.module.onestopauth.module.client_jon-test-10-463.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=e48e1684-a197-41e9-a894-c5a346c102a6]
module.keycloak_dev.module.onestopauth.module.client_jon-test-10-463.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=00f477ac-455a-4133-b3a2-37cf574bf997]
module.keycloak_dev.module.onestopauth.module.client_sprint-demo-1882.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=7c03859a-6587-45b1-9c4e-1c52654b0073]
module.keycloak_dev.module.onestopauth.module.client_sprint-demo-1882.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=8e82755a-3e60-4815-aeea-f20438433eb4]
module.keycloak_dev.module.onestopauth.module.client_sprint-demo-1882.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=b34165d5-4d03-4cc9-8851-c2734fb9a5a5]
module.keycloak_dev.module.onestopauth.module.client_sprint-demo-1882.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=9cb12bc4-8bdb-4d2c-b9db-0728a6709d43]
module.keycloak_dev.module.onestopauth.module.client_sprint-demo-1882.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=46862205-dbca-4f80-9be8-82c8e6cd5f17]
module.keycloak_dev.module.onestopauth.module.client_sprint-demo-1882.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=abd0294c-699d-4d87-adeb-478e131bfe2e]
module.keycloak_dev.module.onestopauth.module.client_sprint-demo-1882.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=8ee7ecf0-1c8f-4053-b28f-f93b208ede41]
module.keycloak_dev.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=5776640a-5533-45d8-854a-261a866a39f6]
module.keycloak_dev.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8ff6a0fe-9347-4bf4-813b-6f589390e6c0]
module.keycloak_dev.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=54ef8733-7d92-4861-856a-a09e62ba595e]
module.keycloak_dev.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=1171f0c5-d99a-433f-8e06-aa9755dcbbea]
module.keycloak_dev.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=0158e912-ee0b-4c71-9e93-f311c88e0e18]
module.keycloak_dev.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=5c0dc433-cdee-409a-a664-454333d15633]
module.keycloak_dev.module.onestopauth.module.client_jon-test-2-265.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=6c7e0646-6f2a-4eb3-a7f4-31b0c340fe41]
module.keycloak_dev.module.onestopauth.module.client_test-68.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=1c284bce-00b0-4fb2-a91d-6f074538b0a2]
module.keycloak_dev.module.onestopauth.module.client_test-68.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=893bcbd7-ec2b-45eb-8359-43eea32080ac]
module.keycloak_dev.module.onestopauth.module.client_test-68.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=c4b0139d-00aa-4243-8f42-9498401e1501]
module.keycloak_dev.module.onestopauth.module.client_test-68.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=9c526bb9-bfb4-4911-9563-d307eeb8561b]
module.keycloak_dev.module.onestopauth.module.client_test-68.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=5486d873-9227-4f7f-90c7-fb55af354dc0]
module.keycloak_dev.module.onestopauth.module.client_test-68.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=9b502c1a-c266-4e70-8c61-bd149a822bb0]
module.keycloak_dev.module.onestopauth.module.client_test-68.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=916ee66d-a8b5-4245-a017-de284fc24705]
module.keycloak_dev.module.onestopauth.module.client_jon-test-1.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=2a0d3020-53e5-4125-8c8f-9ccc07f16046]
module.keycloak_dev.module.onestopauth.module.client_jon-test-1.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=c9eaf799-089e-4c0a-aa22-8f13b61591c4]
module.keycloak_dev.module.onestopauth.module.client_jon-test-1.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=95edc824-5533-47ea-9224-6997adf57152]
module.keycloak_dev.module.onestopauth.module.client_jon-test-1.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ad0f24f5-94ad-47d9-90a3-e9c280a6637b]
module.keycloak_dev.module.onestopauth.module.client_jon-test-1.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=b14318d7-2fef-448d-a616-2379a8be02d4]
module.keycloak_dev.module.onestopauth.module.client_jon-test-1.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=ce475809-4d67-4814-b5cc-a79e02daae50]
module.keycloak_dev.module.onestopauth.module.client_jon-test-1.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=2e998904-774d-48f6-a932-19867e13e464]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-2222-34.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=d51f3680-5a56-42fa-ab7a-1ce46dd41233]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-2222-34.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=e28c54bd-bc2c-45e8-8989-ce583c6cc4c9]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-2222-34.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=55535ce7-35e1-41ed-a676-c4bd95901b73]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-2222-34.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=f2e01476-5a7e-4cb4-8be0-dc8d72a632e5]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-2222-34.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=0ef0c67a-a3c8-43ee-b063-94aee9369cfb]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-2222-34.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=611eb206-5f42-444d-99f8-0e67d30e66e5]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-2222-34.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=ff3a9ce1-8b55-4d29-a4d7-4f5060983d20]
module.keycloak_dev.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=74c7c7f9-e7af-41e3-8186-b3d5e5e80639]
module.keycloak_dev.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=889affb6-1e3a-4390-ba71-b0e0846dae0d]
module.keycloak_dev.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=3fb093c0-f7d1-4ba1-987e-363814f65908]
module.keycloak_dev.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=e5b5688e-2148-4497-a192-6a81b6808246]
module.keycloak_dev.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=bd2afc16-a3a5-474a-8b47-2b30fbd6676f]
module.keycloak_dev.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=ddf77f5a-8101-4fca-aa54-6390449a7f03]
module.keycloak_dev.module.onestopauth.module.client_test-5-08-09-2021-338.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=c912cdfa-fc24-440e-ae83-f9d26f34277b]
module.keycloak_dev.module.onestopauth.module.client_test-2-08-09-2021-332.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=cdacfd7f-d4cf-4b28-b5f8-3610d3b347a6]
module.keycloak_dev.module.onestopauth.module.client_test-2-08-09-2021-332.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=b89a4683-f78b-4f49-b43d-a3fb6de3b557]
module.keycloak_dev.module.onestopauth.module.client_test-2-08-09-2021-332.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=b6cb32b7-ff38-42d7-a36e-3ca3f0a70fc5]
module.keycloak_dev.module.onestopauth.module.client_test-2-08-09-2021-332.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=d6f06ed8-5a10-4b32-ad4e-00c0f21bac44]
module.keycloak_dev.module.onestopauth.module.client_test-2-08-09-2021-332.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=33296c96-6e89-441f-8518-1872653046f3]
module.keycloak_dev.module.onestopauth.module.client_test-2-08-09-2021-332.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=c3451018-ecd3-49e0-913f-45cd6a0fc341]
module.keycloak_dev.module.onestopauth.module.client_test-2-08-09-2021-332.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=4ca0e2aa-0c07-4c65-826a-5d4af73568a4]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.keycloak_dev.module.onestopauth_basic.module.client_zz-3137.keycloak_openid_client.this has been changed
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "11ce6857-5d95-45a8-b96e-9935c87ba943"
        name                                     = "zz-3137"
      + web_origins                              = []
        # (14 unchanged attributes hidden)
    }
  # module.keycloak_test.module.onestopauth_basic.module.client_zz-3137.keycloak_openid_client.this has been changed
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "bbf653e0-f217-437e-a887-ea4b33d0dd08"
        name                                     = "zz-3137"
      + web_origins                              = []
        # (14 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth_basic.module.client_zz-3136.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "zz-3136"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_zz-3136.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_zz-3136.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_zz-3136.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_zz-3136.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "zz-3136"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_zz-3136.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_zz-3136.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_zz-3136.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "CONFIDENTIAL"
      + client_id                                = "zz-3136"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "zz-3136"
      + realm_id                                 = "onestopauth-basic"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "https://.",
        ]
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_zz-3136.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "zz-3136"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_zz-3136.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_zz-3136.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_zz-3136.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_zz-3136.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "zz-3136"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_zz-3136.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_zz-3136.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_test.module.onestopauth_basic.module.client_zz-3136.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "CONFIDENTIAL"
      + client_id                                = "zz-3136"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "zz-3136"
      + realm_id                                 = "onestopauth-basic"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "https://.",
        ]
    }

Plan: 16 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 2904 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*